{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/86e9ba6f-d1ed-48b8-a849-c26f77db8c1b')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/86e9ba6f-d1ed-48b8-a849-c26f77db8c1b')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": null,
      "apiVersion": "2021-10-01-preview",
      "properties": {
        "name": "Detection of Azure AD connector accounts outside of WatchLists",
        "description": "'List of objects with Directory role membership to \"Directory Synchronization\" or naming similar to AAD connector account which aren't stored in the WatchList was found. Indicator of creating AAD connector account as backdoor.''",
        "severity": "Medium",
        "requiredDataConnectors": [
          {
            "connectorId": "AzureActiveDirectory",
            "dataTypes": [
              "AuditLogs"
            ]
          }
        ],
        "queryFrequency": "P1D",
        "queryPeriod": "P1D",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0,
        "tactics": [
          "Persistence",
          "CredentialAccess",
          "PrivilegeEscalation",
          "InitialAccess"          
        ],
        "query": "let DirSyncRoleAssignedMembers = (IdentityInfo \n| where AssignedRoles contains \"Directory Synchronization Accounts\" \n| summarize by AccountObjectId, AccountUPN = tolower(AccountUPN)); \nlet DirSyncNamedUsers = (union isfuzzy=true AADNonInteractiveUserSignInLogs, SigninLogs\n// AADC APIs: AADSync = \"cb1056e2-e479-49de-ae31-7812af012ed8\", AAD Connect v2 = 6eb59a73-39b2-4c23-a70f-e2e3ce8965b1\n| where (UserPrincipalName startswith \"sync_\" and UserPrincipalName endswith \"onmicrosoft.com\") or AppId == \"cb1056e2-e479-49de-ae31-7812af012ed8\" or AppId == \"6eb59a73-39b2-4c23-a70f-e2e3ce8965b1\"\n| summarize by AccountObjectId = UserId, AccountCustomEntity = tolower(UserPrincipalName));\nlet WatchList = _GetWatchlist('ServiceAccounts') | where ['Tags'] == \"Azure AD Connect\" | project AccountObjectId = ['Service AAD Object Id'];\nunion isfuzzy=true DirSyncRoleAssignedMembers,DirSyncNamedUsers\n| distinct tostring(AccountObjectId), AccountCustomEntity\n| where AccountObjectId !in (WatchList)\n",
        "entityMappings": [
          {
            "entityType": "Account",
            "fieldMappings": [
              {
                "identifier": "FullName",
                "columnName": "AccountCustomEntity"
              }
            ]
          }
        ],
        "suppressionDuration": "PT1H",
        "suppressionEnabled": "false",
        "enabled": "true",
        "techniques": [
          "T1098",
          "T1078"
        ],
        "displayName": "Detection of Azure AD connector accounts outside of WatchLists"
      }
    }
  ]
}
